[{
    "link": "https://www.nerdwallet.com/article/finance/subscriptions-are-hard-to-cancel-and-easy-to-forget-by-design",
    "text":"'Click-to-Cancel' regulation aims to make ending subscriptions easier, but you can stay on top of your subscriptions even if the rule gets canceled",
    "image":"",
    "title":"Subscriptions Are Hard to Cancel and Easy to Forget — by Design"
},
{
    "link": "https://www.marketwatch.com/story/tariffs-could-cost-americans-an-extra-2-000-a-year-heres-where-to-find-that-money-in-your-household-budget-6acc454d",
    "text": "Due to tariffs, average household expenses in the U.S. could rise by $1,200 to $1,600 annually, adding to the financial burden many Americans already face due to inflation.",
    "title": "Tariffs could cost Americans an extra $1,600 a year. Here's where to find that money in your household budget."
  },
  {
    "link": "https://thefinancialdiet.com/5-sneaky-expenses-you-could-easily-be-spending-too-much-on/",
    "text": "An article discussing sneaky expenses that can impact your budget, including TV and internet services.",
    "title": "5 Sneaky Expenses You Could Easily Be Spending Too Much On"
  },
  {
    "link": "https://www.matadors.org/post/sneaky-expenses-that-drain-your-wallet",
    "text": "An article highlighting sneaky expenses that drain your wallet, such as subscription creep and unused memberships.",
    "title": "Sneaky Expenses That Drain Your Wallet"
  },
  {
    "link": "https://worthly.com/how-to-save-money/20-expenses-that-could-be-impacting-your-budget/",
    "text": "An article listing 20 expenses that could be impacting your budget, including unused subscription services and bank and credit card fees.",
    "title": "20 Expenses That Could Be Impacting Your Budget - Worthly"
  },
  {
    "link": "https://www.thescottishsun.co.uk/money/14069842/save-money-2025-budget-fix-quick-debt-help/",
    "text": "Seven quick financial tips to potentially save nearly £4,000 in 2025, including canceling unnecessary subscriptions and checking insurance bills.",
    "title": "Seven five-minute jobs to boost your finances by almost £4,000 in 2025"
  }
]